from sklearn.feature_selection import RFE
from sklearn.linear_model import LogisticRegression
import pandas as pd
from sklearn.datasets import load_iris
from sklearn.feature_selection import SelectFromModel
# iris = load_iris()
# X, y = iris.data, iris.target

Y = pd.read_csv("Target.csv")
X = pd.read_csv("STD.csv")
names=X.columns
#递归特征消除法，返回特征选择后的数据
#参数estimator为基模型
#参数n_features_to_select为选择的特征个数
rfe = RFE(estimator=LogisticRegression(), n_features_to_select=100)
rfe.fit_transform(X, Y)
print (sorted(zip(map(lambda x:round(x,4), rfe.ranking_),names)))

# result:
# [(1, 'V10'), (1, 'V100'), (1, 'V101'), (1, 'V103'), (1, 'V105'), (1, 'V106'), (1, 'V107'), (1, 'V109'), (1, 'V11'), (1, 'V110'), (1, 'V111'), (1, 'V112'), (1, 'V113'), (1, 'V114'), (1, 'V115'), (1, 'V117'), (1, 'V119'), (1, 'V12'), (1, 'V121'), (1, 'V123'), (1, 'V124'), (1, 'V125'), (1, 'V127'), (1, 'V128'), (1, 'V13'), (1, 'V14'), (1, 'V16'), (1, 'V17'), (1, 'V18'), (1, 'V19'), (1, 'V20'), (1, 'V21'), (1, 'V22'), (1, 'V23'), (1, 'V24'), (1, 'V25'), (1, 'V26'), (1, 'V27'), (1, 'V28'), (1, 'V29'), (1, 'V30'), (1, 'V31'), (1, 'V32'), (1, 'V33'), (1, 'V34'), (1, 'V35'), (1, 'V36'), (1, 'V37'), (1, 'V38'), (1, 'V39'), (1, 'V4'), (1, 'V40'), (1, 'V41'), (1, 'V44'), (1, 'V46'), (1, 'V47'), (1, 'V49'), (1, 'V5'), (1, 'V50'), (1, 'V52'), (1, 'V53'), (1, 'V54'), (1, 'V55'), (1, 'V56'), (1, 'V57'), (1, 'V58'), (1, 'V59'), (1, 'V6'), (1, 'V61'), (1, 'V62'), (1, 'V64'), (1, 'V65'), (1, 'V66'), (1, 'V67'), (1, 'V69'), (1, 'V7'), (1, 'V70'), (1, 'V71'), (1, 'V73'), (1, 'V74'), (1, 'V75'), (1, 'V76'), (1, 'V77'), (1, 'V79'), (1, 'V8'), (1, 'V80'), (1, 'V81'), (1, 'V82'), (1, 'V83'), (1, 'V85'), (1, 'V86'), (1, 'V87'), (1, 'V88'), (1, 'V89'), (1, 'V91'), (1, 'V92'), (1, 'V94'), (1, 'V95'), (1, 'V97'), (1, 'V98'), (2, 'V102'), (3, 'V3'), (4, 'V99'), (5, 'V42'), (6, 'V78'), (7, 'V118'), (8, 'V43'), (9, 'V45'), (10, 'V96'), (11, 'V126'), (12, 'V104'), (13, 'V93'), (14, 'V84'), (15, 'V68'), (16, 'V108'), (17, 'V90'), (18, 'V116'), (19, 'V63'), (20, 'V15'), (21, 'V60'), (22, 'V72'), (23, 'V122'), (24, 'V48'), (25, 'V9'), (26, 'V120'), (27, 'V51')]
